УТ_для_edt/src/InformationRegisters/CRM_ЖурналДокументов/CRM_ЖурналДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ЖурналДокументов</name>
  <resources>
    <name>ТипОбъекта</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CRM_ОбъектыЖурналаДокументов</types>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </resources>
  <resources>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </resources>
  <resources>
    <name>ВходящееИсходящее</name>
    <type>
      <types>EnumRef.CRM_ВходящееИсходящееСобытие</types>
    </type>
  </resources>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.CRM_ВидыСобытий</types>
    </type>
  </resources>
  <resources>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеСобытия</name>
    <type>
      <types>CatalogRef.CRM_СостоянияСобытий</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеИнтереса</name>
    <comment>Состояние интереса</comment>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьПрисоединенныеФайлы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойИнтерес</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИнтересЯвляетсяОснованием</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СписокУчастников</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ГлавнаяЗапись</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>Characteristic.CRM_ОбъектыЖурналаДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CRM_Интерес</name>
    <comment>Интерес</comment>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_ИсторияСостоянийОбращений/CRM_ИсторияСостоянийОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ИсторияСостоянийОбращений</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>смартСтатусRoistat</name>
    <comment>#Б-1538 смарт: Лопато 05.12.2024 //Интеграция с ROIStat. Добавить справочник Статусы ROIStat, доработать регистр состояний Интересов</comment>
    <type>
      <types>CatalogRef.смартСтатусыRoistat</types>
    </type>
  </attributes>
  <dimensions>
    <name>Обращение</name>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_НастройкиЭтаповБизнесПроцессов/CRM_НастройкиЭтаповБизнесПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_НастройкиЭтаповБизнесПроцессов</name>
  <resources>
    <name>ВариантВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВариантВыполненияСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДлительностьДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлительностьЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлительностьМинут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Задание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.CRM_КартыМаршрутов</types>
      <types>CatalogRef.Проекты</types>
    </type>
  </resources>
  <resources>
    <name>ИсполнительСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ОтложитьНачалоЭтапаДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтложитьНачалоЭтапаЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтложитьНачалоЭтапаМинут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаВходящая</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>НапомнитьОбОкончанииДней</name>
    <comment>Дней, за которое будет напомнено о наступлении срока исполнения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НапомнитьОбОкончанииЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НапомнитьОбОкончанииМинут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтложитьНачалоЭтапаДоступно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>BusinessProcessRef.CRM_БизнесПроцесс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.CRM_ТочкиМаршрутов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Состояние</name>
    <type>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Catalogs/CRM_СостоянияИнтересов/CRM_СостоянияИнтересов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_СостоянияИнтересов</name>
  <comment>Сценарии продаж</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ВероятностьСделки</name>
    <comment>Вероятность сделки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДела</name>
    <type>
      <types>CatalogRef.CRM_ВидыДелВзаимодействий</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершено</name>
    <comment>Состояние завершения интереса</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_УказаниеОжидаемойВыручки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСостояния</name>
    <type>
      <types>EnumRef.CRM_ВидыСостоянияИнтереса</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Офис</name>
    <type>
      <types>CatalogRef.CRM_ОфисыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ОбязательноеЗаполнениеКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеПланированиеАктивности</name>
    <type>
      <types>EnumRef.CRM_ПланируемыеТипыАктивности</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтерактивноеПланированиеАктивностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьЗапланированныеАктивности</name>
    <type>
      <types>EnumRef.CRM_ЗавершаемыеТипыАктивности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборЗавершаемыхАктивностей</name>
    <type>
      <types>EnumRef.CRM_ОтборыЗавершаемыхАктивностей</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьДостигнутыйРезультат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавитьВероятностьВПредставлениеСостояния</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПредопределенногоЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЦвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьЗадачу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПоддержка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияСостояния</name>
    <type>
      <types>EnumRef.CRM_КатегорииСостоянийПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяемыеРеквизитыИнтереса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяемыеРеквизитыИнтересаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРолевуюАдресацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокируемыеРеквизитыИнтереса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокируемыеРеквизитыИнтересаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйСрокНаЭтапе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартОписаниеЭтапа</name>
    <comment>//++ #1656 смарт: Фролов 27.02.2023 //Создание механизма отображения необходимых действий менеджером, на каждом этапе обработки Интереса.</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаКвалификацию</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаВыставлениеКП</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаСогласованиеКП</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаВыставлениеСчета</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаОплату</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТипыУслуг</name>
    <attributes>
      <name>ТипУслуги</name>
      <type>
        <types>CatalogRef.CRM_ТипУслуги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыОбращений</name>
    <attributes>
      <name>ТипОбращения</name>
      <type>
        <types>CatalogRef.CRM_ТипыОбращений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартТипыУслуг</name>
    <attributes>
      <name>ТипУслуги</name>
      <type>
        <types>CatalogRef.CRM_ТипУслуги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/CommonModules/CRM_ИнтересыСервер/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция проверяет наличие объектов по Интересу.
//
// Параметры:
//  Интерес					- ДокументСсылка	- Интерес
//  СписокОбязательныхТипов	- СписокЗначений	- Список обязательных типов.
// 
// Возвращаемое значение:
//  Массив - Массив ошибок
//
Функция ПроверкаНаличияОбъектовПоИнтересу(Интерес, СписокОбязательныхТипов)Экспорт
	РегНабор = РегистрыСведений.CRM_ЖурналДокументов.СоздатьНаборЗаписей();
	РегНабор.Отбор.CRM_Интерес.Установить(Интерес);
	РегНабор.Прочитать();
	МассивОшибок = Новый Массив;
	Для Каждого ЭлементСписка Из СписокОбязательныхТипов Цикл
		Если ТипЗнч(ЭлементСписка.Значение) = Тип("Тип") Тогда
			ИскомыйТип = ЭлементСписка.Значение;
		ИначеЕсли ТипЗнч(ЭлементСписка.Значение) = Тип("СправочникСсылка.ИдентификаторыОбъектовМетаданных") Тогда
			ИскомыйТип = ТипЗнч(ЭлементСписка.Значение.ЗначениеПустойСсылки);
		Иначе
			Продолжить;
		КонецЕсли;
		ЕстьОбъект = Ложь;
		Для Каждого СтрокаНабора Из РегНабор Цикл
			Если ТипЗнч(СтрокаНабора.Объект) = ИскомыйТип Тогда
				ЕстьОбъект = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НЕ ЕстьОбъект Тогда
			МетаДокумента = Метаданные.НайтиПоТипу(ИскомыйТип);
			Синоним		= МетаДокумента.Синоним;
			ПолноеИмя	= МетаДокумента.ПолноеИмя();
			ТекстСообщения = НСтр("ru='Не введен документ %Синоним%. Действие невозможно выполнить!';en='Document %Синоним% not enter. It is impossible to execute action!'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Синоним%", Синоним);
			МассивОшибок.Добавить(ТекстСообщения);
		КонецЕсли;
	КонецЦикла;
	Возврат МассивОшибок;
КонецФункции // ПроверкаНаличияОбъектовПоБизнесПроцессу()

// Функция рассчитывает ожидаемую дату продажи по Интересу.
//
// Параметры:
//  Интерес		- ДокументСсылка, ДокументОбъект	- Интерес
//  ЭтоПереход	- Булево			 				- Признак перехода.
// 
// Возвращаемое значение:
//  Дата - Ожидаемая дата продажи
//
Функция ПлановаяДатаПродажи(Интерес, ЭтоПереход = Истина) Экспорт
	
	ДатаНачала = ТекущаяДатаСеанса();
	Если НЕ ЭтоПереход Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	История.Период КАК Период
		                      |ИЗ
		                      |	РегистрСведений.CRM_ИсторияСостоянийОбращений.СрезПоследних(&ТекДата, Обращение = &Интерес) КАК История");
		Запрос.УстановитьПараметр("ТекДата", ДатаНачала);
		Запрос.УстановитьПараметр("Интерес", Интерес.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДатаНачала = Выборка.Период;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                      |	CRM_СостоянияИнтересов.Ссылка КАК Состояние,
	                      |	CRM_СостоянияИнтересов.ОжидаемыйСрокНаЭтапе КАК ОжидаемыйСрок,
	                      |	CRM_СостоянияИнтересов.РеквизитДопУпорядочивания КАК Порядок,
	                      |	CRM_СостоянияИнтересов.Завершено КАК Завершено
	                      |ПОМЕСТИТЬ СостоянияБП
	                      |ИЗ
	                      |	БизнесПроцесс.CRM_БизнесПроцесс КАК CRM_БизнесПроцесс
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_НастройкиЭтаповБизнесПроцессов КАК CRM_НастройкиЭтаповБизнесПроцессов
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_СостоянияИнтересов КАК CRM_СостоянияИнтересов
	                      |			ПО CRM_НастройкиЭтаповБизнесПроцессов.Состояние = CRM_СостоянияИнтересов.Ссылка
						  |				И CRM_СостоянияИнтересов.РеквизитДопУпорядочивания >= &Порядок
	                      |		ПО CRM_БизнесПроцесс.Ссылка = CRM_НастройкиЭтаповБизнесПроцессов.Объект
	                      |ГДЕ
	                      |	НЕ CRM_БизнесПроцесс.ПометкаУдаления
	                      |	И НЕ CRM_БизнесПроцесс.Завершен
	                      |	И CRM_БизнесПроцесс.Интерес = &Интерес
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СУММА(СостоянияБП.ОжидаемыйСрок) КАК ОжидаемыйСрок,
	                      |	МАКСИМУМ(СостоянияБП.Порядок) КАК Порядок,
	                      |	МАКСИМУМ(СостоянияБП.Завершено) КАК Завершено
	                      |ИЗ
	                      |	СостоянияБП КАК СостоянияБП");
	Запрос.УстановитьПараметр("Порядок", Интерес.СостояниеИнтереса.РеквизитДопУпорядочивания);
	Запрос.УстановитьПараметр("Интерес", Интерес.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Порядок) Тогда
		Длительность = Выборка.ОжидаемыйСрок;
		Порядок = Выборка.Порядок;
		Завершено = Выборка.Завершено;
	Иначе
		Длительность = Интерес.СостояниеИнтереса.ОжидаемыйСрокНаЭтапе;
		Порядок = Интерес.СостояниеИнтереса.РеквизитДопУпорядочивания;
		Завершено = Интерес.СостояниеИнтереса.Завершено;
	КонецЕсли;
	
	Если Не Завершено Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	СУММА(CRM_СостоянияИнтересов.ОжидаемыйСрокНаЭтапе) КАК ОжидаемыйСрок
		               |ИЗ
		               |	Справочник.CRM_СостоянияИнтересов КАК CRM_СостоянияИнтересов
		               |ГДЕ
		               |	CRM_СостоянияИнтересов.РеквизитДопУпорядочивания > &Порядок
		               |	И CRM_СостоянияИнтересов.Родитель = &Сценарий
		               |	И CRM_СостоянияИнтересов.Используется
		               |	И НЕ CRM_СостоянияИнтересов.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("Порядок", Порядок);
		Запрос.УстановитьПараметр("Сценарий", Интерес.СостояниеИнтереса.Родитель);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ОжидаемыйСрок) Тогда
			Длительность = Длительность + Выборка.ОжидаемыйСрок;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Длительность) Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	СУММА(CRM_СостоянияИнтересов.ОжидаемыйСрокНаЭтапе) КАК ОжидаемыйСрок
		               |ИЗ
		               |	Справочник.CRM_СостоянияИнтересов КАК CRM_СостоянияИнтересов
		               |ГДЕ
		               |	CRM_СостоянияИнтересов.Родитель = &Сценарий
		               |	И CRM_СостоянияИнтересов.Используется
		               |	И НЕ CRM_СостоянияИнтересов.ПометкаУдаления";
		Запрос.УстановитьПараметр("Сценарий", Интерес.СостояниеИнтереса.Родитель);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ОжидаемыйСрок) Тогда
			Возврат ДатаНачала;
		КонецЕсли;
		Возврат Дата(1,1,1);
	КонецЕсли;
	
	Календарь = Константы.ОсновнойКалендарьПредприятия.Получить();
	ОжидаемаяДатаПродажи = CRM_КалендарныеГрафики.ПолучитьДатуПоКалендарю(Календарь, ДатаНачала, Длительность, Ложь, Истина);
	
	Если ОжидаемаяДатаПродажи = Неопределено Тогда
		ОжидаемаяДатаПродажи = ДатаНачала + Длительность * 86400;
	КонецЕсли;
	
	Возврат ОжидаемаяДатаПродажи;
КонецФункции

// Функция рассчитывает срок нахождения на текущем этапе Интереса.
//
// Параметры:
//  Интерес	- ДокументСсылка	- Интерес
// 
// Возвращаемое значение:
//  Число - Продолжительность нахождения в текущем состоянии в днях
//
Функция СрокНаТекущемЭтапе(Интерес) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(КалендарныеГрафики.ДатаГрафика) КАК СрокНаЭтапе
	                      |ИЗ
	                      |	РегистрСведений.CRM_ИсторияСостоянийОбращений.СрезПоследних(&ТекущаяДата, Обращение = &Интерес) КАК CRM_ИсторияСостоянийОбращенийСрезПоследних
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
	                      |		ПО CRM_ИсторияСостоянийОбращенийСрезПоследних.Период <= КалендарныеГрафики.ДатаГрафика
	                      |			И (КалендарныеГрафики.ДеньВключенВГрафик)
	                      |			И (КалендарныеГрафики.ДатаГрафика <= &ТекущаяДата)
	                      |			И (КалендарныеГрафики.Календарь = &Календарь)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	CRM_ИсторияСостоянийОбращенийСрезПоследних.Состояние.ОжидаемыйСрокНаЭтапе");
	
	Запрос.УстановитьПараметр("Интерес", Интерес);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Календарь", Константы.ОсновнойКалендарьПредприятия.Получить());
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СрокНаЭтапе;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

// Функция рассчитывает прододжительность нахождения на этапах Интереса в рабочих днях.
//
// Параметры:
//  Интерес	- ДокументСсылка	- Интерес
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица состояний интереса с датой переходя на этап и продолжительностью этапа в рабочих днях.
//
Функция СрокиНаЭтапах(Интерес) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(КалендарныеГрафики.ДатаГрафика) КАК СрокНаЭтапе,
	                      |	CRM_ИсторияСостоянийОбращений.Состояние КАК Состояние,
	                      |	CRM_ИсторияСостоянийОбращений.Период КАК ДатаПерехода
	                      |ИЗ
	                      |	РегистрСведений.CRM_ИсторияСостоянийОбращений КАК CRM_ИсторияСостоянийОбращений
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
	                      |		ПО CRM_ИсторияСостоянийОбращений.Период <= КалендарныеГрафики.ДатаГрафика
	                      |			И (КалендарныеГрафики.ДеньВключенВГрафик)
	                      |			И (ВЫБОР
	                      |				КОГДА CRM_ИсторияСостоянийОбращений.ДатаЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	                      |					ТОГДА КалендарныеГрафики.ДатаГрафика <= CRM_ИсторияСостоянийОбращений.ДатаЗавершения
	                      |				ИНАЧЕ КалендарныеГрафики.ДатаГрафика <= &ТекущаяДата
	                      |			КОНЕЦ)
	                      |			И (КалендарныеГрафики.Календарь = &Календарь)
	                      |ГДЕ
	                      |	CRM_ИсторияСостоянийОбращений.Обращение = &Интерес
	                      |	И НЕ CRM_ИсторияСостоянийОбращений.Состояние.Завершено
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	CRM_ИсторияСостоянийОбращений.Состояние.ОжидаемыйСрокНаЭтапе,
	                      |	CRM_ИсторияСостоянийОбращений.Состояние,
	                      |	CRM_ИсторияСостоянийОбращений.Период
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДатаПерехода");
	
	Запрос.УстановитьПараметр("Интерес", Интерес);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Календарь", Константы.ОсновнойКалендарьПредприятия.Получить());
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
	
КонецФункции

#КонецОбласти
